app/views/songs/_form.html.erb

SELECT "albums".* FROM "albums"
---
	<div class="field">
		<% albums = Album.all.collect {|i| [ h(i.name), i.id ] } %>