app/views/albums/index.html.erb

SELECT "songs".* FROM "songs" WHERE ("songs".album_id IN (91450344,477772384))
---
		  <ol>
			<% album.songs.each do |song| %>