app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
SELECT "songs".* FROM "songs" WHERE ("songs".album_id IN (91450344,477772384))
---
  def index
    # @albums = Album.all()
    @albums = Album.all(:include => [:songs])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 LIMIT 1
---
  def show
    @album = Album.find(params[:id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 LIMIT 1
---
  def edit
    @album = Album.find(params[:id])

INSERT INTO "albums" ("name", "description", "year", "created_at", "updated_at") VALUES ('My Album 1', 'aoeu aoeu aoeuaoeuaoeu', 2011, '2011-02-18 00:08:44.577673', '2011-02-18 00:08:44.577673')
---
  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 3 LIMIT 1
UPDATE "albums" SET "description" = 'The first album in the database!!!', "updated_at" = '2011-04-01 01:15:03.189458' WHERE "albums"."id" = 477772384
---
  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 5 LIMIT 1
DELETE FROM "albums" WHERE "albums"."id" = 5
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy